AF-mainblog.org
#+STARTUP: content
#+AUTHOR: Ambrose Field
#+HUGO_BASE_DIR: .
#+HUGO_AUTO_SET_LASTMOD: 
** Summer 1971: Imperfect forms - Ken Kirschner Remixed
:PROPERTIES:
:EXPORT_FILE_NAME: Kirschner
:END:

{{< bandcamp 1163390045 >}}
# nb: hardwired in shortcodes directory to my track2
# will need to fix the bandcamp shortcode to take 2 parameters, one for track.
# this is a broken bodge!

*** Imperfect Forms - The Music of Kenneth Kirschner Remixed

I was invited to collaborate in the re-mixing of Ken Kirshner's beautiful music. But instead of remixing the work, I decided to intervene at an earlier stage and re-perform it prior to electronic manipulation.

This work is an extract from a longer un-published set of pieces, /Kirschner Varations/. The work explores how borrowing (acknowledged, and with permission) from a living composer might feel. Part of the problem of /Being Dufay/ was that it wasn't possible to ask Dufay what he thought. Ken Kirschner, on the other hand, was able to input and kindly permitted the re-use of his piece. 

Rather than re-using the original piano material as recorded audio, I transcribed and re-performed it on the piano using small loundspeakers mounted inside the piano on the soundboard. Environmental sounds were played through these speakers influencing the colour of the notes and sustains. I wanted to create a dreamy atmosphere with a tint of sonic nostalgia. Reprocessing of the recorded audio was accomplished using the Kyma Sound Design workstation (Kyma/Capybara). This particular track is one of the more highly processed, leaving little trace of the original recordings as the soundscape here is distilled to just the essential elements. 

