content/research/Kirschner.md
+++
title = "Summer 1971: Imperfect forms - Ken Kirschner Remixed"
author = ["Ambrose Field"]
draft = false
weight = 2011
noauthor = true
nocomment = true
nodate = true
nopaging = true
noread = true
[menu.main]
  weight = 2011
  identifier = "summer-1971-imperfect-forms-ken-kirschner-remixed"
+++

{{< bandcamp 1163390045 >}}


## Imperfect Forms - The Music of Kenneth Kirschner Remixed {#imperfect-forms-the-music-of-kenneth-kirschner-remixed}

I was invited to collaborate in the re-mixing of Ken Kirshner's beautiful music. But instead of remixing the work, I decided to intervene at an earlier stage and re-perform it prior to electronic manipulation.

This work is an extract from a longer un-published set of pieces, _Kirschner Varations_. The work explores how borrowing (acknowledged, and with permission) from a living composer might feel. Part of the problem of _Being Dufay_ was that it wasn't possible to ask Dufay what he thought. Ken Kirschner, on the other hand, was able to input and kindly permitted the re-use of his piece.

Rather than re-using the original piano material as recorded audio, I transcribed and re-performed it on the piano using small loundspeakers mounted inside the piano on the soundboard. Environmental sounds were played through these speakers influencing the colour of the notes and sustains. I wanted to create a dreamy atmosphere with a tint of sonic nostalgia. Reprocessing of the recorded audio was accomplished using the Kyma Sound Design workstation (Kyma/Capybara). This particular track is one of the more highly processed, leaving little trace of the original recordings as the soundscape here is distilled to just the essential elements.